--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Evaluation_4\COMBARY_Resultats_9_10_11.log
  log type:  text
 opened on:  26 Apr 2021, 10:18:19

. set more off

. 
. //*EXERCICE PRATIQUE 1*//
. 
. /*Supposons que la population est composée de six individus. Les niveaux de chacune des trois di
> mensions du bien-être sont rapportés dans le tableau ci-dessous.*/
. 
. clear

. input individu W1 W2 W3 

      individu         W1         W2         W3
  1. 1       1       5       3
  2. 2       2       3       0
  3. 3       4       4       6
  4. 4       3       3       4
  5. 5       7       5       4
  6. 6       6       4       3
  7. end 

. 
. /*Supposons que le seuil de pauvreté pour chacune des trois dimensions soit de 3.5. Effectuer le
> s calculs suivants avec Stata.*/
. 
. /*1.1 En utilisant l'approche de l’union, estimez la proportion d'individus pauvres. Refaites l'
> estimation à l'aide de la commande DASP appropriée.*/
.  
. /*Réponse : selon l'approche de l'union, les pauvres sont ceux qui ont au moins une dimension de
>  privation de bien être par rapport au seuil de pauvreté. 
> Le tableau indique que les individus 1, 2, 4 et 6 ont au moins une dimension de privation de bie
> n être par rapport au seuil de pauvreté (3.5). Par conséquent, 
> le taux de pauvreté peut être estimé à 4/6, soit 0,6666 */     
. 
. /*vérification du résultat avec la commande DASP*/
. imdp_uhi W1 W2 W3, pl1(3.5) pl2(3.5) pl3(3.5)

    M.D. Poverty index :  Union headcount index                          
-----------------------------------------------------------------------------+
            |       Estimate            STE             LB              UB   |
------------+----------------------------------------------------------------|
Population  |           0.667           0.211           0.242           1.091|
-----------------------------------------------------------------------------+

. 
. /*1.2 En utilisant l'approche par intersection, estimez la proportion d'individus pauvres. Refai
> tes l'estimation à l'aide de la commande DASP appropriée.*/
. 
. /*Réponse : selon l'approche par intersection, les pauvres sont ceux qui ont des privations sur 
> toutes dimensions de bien être par rapport au seuil de pauvreté. 
> Le tableau indique que seul l'individu 2 a des privations sur toutes dimensions de bien être par
>  rapport au seuil de pauvreté (3.5). Par conséquent, le taux de 
> pauvreté peut être estimé à 1/6, soit 0,1666 */ 
. 
. /*vérification du résultat avec la commande DASP*/
. imdp_ihi W1 W2 W3, pl1(3.5) pl2(3.5) pl3(3.5)

    M.D. Poverty index :  Intersection headcount index                   
-----------------------------------------------------------------------------+
            |       Estimate            STE             LB              UB   |
------------+----------------------------------------------------------------|
Population  |           0.167           0.167          -0.169           0.503|
-----------------------------------------------------------------------------+

. 
. /*1.3 Quelle approche est la plus sensible à l'augmentation des privations multiples individuell
> es ? */
. 
. /*Réponse : L'approche de l'union est la plus sensible parce que plus il y a de privation sur de
> s dimensions de bien entre par rapport au seuil de pauvreté, plus 
> le taux de pauvreté est élevé.*/
. 
. /*1.4 Estimez l’indice Alkire et Foster MPI(α=0) lorsque le seuil dimensionnel est égal à 2 (les
>  pauvres sont ceux qui ont deux ou trois dimensions de privation).*/
. 
. /*1.5 Estimez maintenant les mêmes indices à l'aide de la commande DASP appropriée. Discutez des
>  résultats.*/
. 
. imdp_afi W1 W2 W3, dcut(2) w1(1) pl1(3.5) w2(1) pl2(3.5) w3(1) pl3(3.5)

    Alkire and Foster (2007) MDP indices
  +---------------------------------------------------------------------------------------------+
  |    Group   |     Pop. share             H0              M0              M1              M2  |
  |------------+--------------------------------------------------------------------------------|
  |Population  |           1.000           0.500           0.389           0.151           0.099|
  |            |           0.000           0.224           0.181           0.087           0.067|
  +---------------------------------------------------------------------------------------------+

    The relative contribution of dimensions to the Alkire and Foster (2007) 
    MDP indices estimated at population level (results in %).
  +-------------------------------------------------------------+
  |Dimensions  |            M0              M1              M2  |
  |------------+------------------------------------------------|
  |W1          |           42.86           47.37           40.23|
  |            |            5.48           17.81           26.07|
  |W2          |           28.57           10.53            2.30|
  |            |           11.40            5.90            1.49|
  |W3          |           28.57           42.11           57.47|
  |            |           11.40           16.96           25.91|
  +-------------------------------------------------------------+

. /*Réponse : La commande ci-dessus DASP permet de calculer l’indice de pauvreté multidimensionnel
> le d’Alkire et Foster MPI (α=0)  qui est estimé à 0,389 (les détails sont dans le fichier de rés
> ultats). Ce qui signifie que la pauvreté touche 38,9% des individus. Les résultats indiquent que
>  par rapport aux dimensions 2 (28,57%) et 3 (28,57%), la dimension 1 (42,86%) contribue le plus 
> à la pauvreté multidimensionnelle.*/
. 
. /*1.6 Supposons que le gouvernement dispose de 6 $ et puisse cibler une dimension à l’aide d’un 
> transfert universel. Quelle dimension ciblée réduirait le plus l'indice d'union et l'indice d'in
> tersection ? Discutez de vos résultats.*/   
. 
. save "C:\Evaluation_4\COMBARY_Data_0.dta", replace  
file C:\Evaluation_4\COMBARY_Data_0.dta saved

. 
. //*EXERCICE PRATIQUE 2*//
. 
. /*Dans le cas de la dimension tridimensionnelle du bien-être, l'indice de pauvreté de Bourguigno
> n et Chakravarty (2003) (l’indice BC) est défini comme suit :
> Avec les données de l’exercice 1,*/ 
. 
. /*2.1 Estimez l’indice de pauvreté de Bourguignon et Chakravarty (2003) lorsque β_i=1/3  ∀ i, z_
> i=3.5 ∀ i,   α=1 et ρ=1.*/  
. 
. clear

. set obs 6
number of observations (_N) was 0, now 6

. qui input individu W1 Z1 W2 Z2 W3 Z3

. 
. scalar beta1=0.33

. scalar beta2=0.33

. scalar beta3=0.33

. scalar alpha=1

. scalar rho=1 

. 
. gen ngap1=(Z1-W1)/Z1*(Z1>W1)

. gen ngap2=(Z2-W2)/Z2*(Z2>W2)

. gen ngap3=(Z3-W3)/Z3*(Z3>W3)

. 
. gen pi=(beta1*ngap1^rho+beta2*ngap2^rho+beta3*ngap3^rho)^alpha/rho 

. 
. qui sum pi in 1/6

. scalar MDP_BC=r(mean)

. gen MDP_BC=r(mean)

. 
. /*l’indice de pauvreté multidimensionnel de Bourguignon et Chakravarty (2003) est de 0,15714286*
> /
. 
. /*2.2 Reprise de l'estimation de l’indice de pauvreté multidimensionnel de Bourguignon et Chakra
> varty à l'aide de la commande DASP appropriée.*/
. 
. imdp_bci W1 W2 W3, alpha(1) gamma(1) b1(0.33) pl1(3.5) b2(0.33) pl2(3.5) b3(0.33) pl3(3.5)

    M.D. Poverty index :  Bourguignon and Chakravarty (2003)             
-----------------------------------------------------------------------------+
            |       Estimate            STE             LB              UB   |
------------+----------------------------------------------------------------|
Population  |           0.157           0.084          -0.012           0.326|
-----------------------------------------------------------------------------+

. 
. /*l’indice de pauvreté multidimensionnel de Bourguignon et Chakravarty (2003) est de 0,157*/
. 
. /*2.3 Générez trois nouvelles variables (nw_ *) dans lesquelles les individus égalisent leurs di
> mensions de bien-être (exemple : gen nw_1 = (w_1+ w_2+w_3)/3) 
> (c'est-à-dire, par exemple, l'individu 1 a 1, 5, 3 dans les trois dimensions respectivement. Apr
> ès l’égalisation, nous aurons : 3, 3, 3.). Ensuite, en utilisant 
> DASP, réestimez l’indice BC avec les nouveaux vecteurs du bien-être. Expliquez la direction du c
> hangement dans l'indice BC.*/
. 
. gen nW1=(W1+W2+W3)/3

. gen nW2=(W1+W2+W3)/3

. gen nW3=(W1+W2+W3)/3

. 
. imdp_bci nW1 nW2 nW3, alpha(1) gamma(1) b1(0.33) pl1(3.5) b2(0.33) pl2(3.5) b3(0.33) pl3(3.5)

    M.D. Poverty index :  Bourguignon and Chakravarty (2003)             
-----------------------------------------------------------------------------+
            |       Estimate            STE             LB              UB   |
------------+----------------------------------------------------------------|
Population  |           0.118           0.083          -0.050           0.286|
-----------------------------------------------------------------------------+

. 
. save "C:\Evaluation_4\COMBARY_Data_1.dta", replace 
(note: file C:\Evaluation_4\COMBARY_Data_1.dta not found)
file C:\Evaluation_4\COMBARY_Data_1.dta saved

. 
end of do-file

. exit, clear
